csmdqq-source/pv-iot-project/stm32-firmware/Zigbee_OnOff_Server_Coord/STM32_WPAN/App/app_zigbee.c
/* USER CODE BEGIN Header */
/**
******************************************************************************
* File Name : App/app_zigbee.c
* Description : Zigbee Application.
******************************************************************************
* @attention
*
* Copyright (c) 2019-2021 STMicroelectronics.
* All rights reserved.
*
* This software is licensed under terms that can be found in the LICENSE file
* in the root directory of this software component.
* If no LICENSE file comes with this software, it is provided AS-IS.
*
******************************************************************************
*/
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "app_common.h"
#include "app_entry.h"
#include "dbg_trace.h"
#include "app_zigbee.h"
#include "zigbee_interface.h"
#include "shci.h"
#include "stm_logging.h"
#include "app_conf.h"
#include "stm32wbxx_core_interface_def.h"
#include "zigbee_types.h"
#include "stm32_seq.h"
#include "zigbee.aps.h"
#include "zigbee.nwk.h"
#include "zigbee.zdo.h"

/* Private includes -----------------------------------------------------------*/
#include <assert.h>
#include "zcl/zcl.h"
#include "zcl/zcl.enum.h"
#include "zcl/general/zcl.onoff.h"
#include "zcl/general/zcl.basic.h"

/* USER CODE BEGIN Includes */
#include "stm32wb5mm_dk.h"
#include "stm32wb5mm_dk_lcd.h"
#include "stm32_lcd.h"
#include "hw_if.h"
#include "a7670e.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
/* USER CODE END PTD */

/* Private defines -----------------------------------------------------------*/
#define APP_ZIGBEE_STARTUP_FAIL_DELAY 500U
#define CHANNEL 15

#define SW1_ENDPOINT 17
#define SNIFFER_ENDPOINT 1  // 鏂板锛氱敤浜庢姄鍙栨墍鏈夊彂寰€ EP1 鐨勬姤鏂?

/* USER CODE BEGIN PD */
#define SW1_GROUP_ADDR 0x0001
#define PERMIT_JOIN_DELAY 60 /* 10s */
#define TUYA_CLUSTER_ID 0xEF00
#define TUYA_TARGET_ENDPOINT 1U
#define TUYA_QUERY_PERIOD_MS 10000U  /* 10绉掓煡璇竴娆″姛鐜囨暟鎹?*/

#define MQTT_TOPIC          "pv/device_001/data"
#define MQTT_DEVICE_ID      "device_001"
#define MQTT_JSON_BUF_SIZE  256U
#define MQTT_DEFAULT_EFFICIENCY_X10   5U    /* 0.5 */
#define MQTT_DEFAULT_TEMPERATURE_X10 353U   /* 35.3 */

#ifndef TUYA_VERBOSE_LOG
#define TUYA_VERBOSE_LOG 0
#endif

#if TUYA_VERBOSE_LOG
#define TUYA_LOG(...) APP_DBG(__VA_ARGS__)
#else
#define TUYA_LOG(...) do {} while (0)
#endif

/* USER CODE END PD */

/* Private macros ------------------------------------------------------------*/
/* USER CODE BEGIN PM */
/* USER CODE END PM */

/* External definition -------------------------------------------------------*/
enum ZbStatusCodeT ZbStartupWait(struct ZigBeeT *zb, struct ZbStartupT *config);
extern uint32_t LCD_Inst;

/* USER CODE BEGIN ED */
/* USER CODE END ED */

/* Private function prototypes -----------------------------------------------*/
static void APP_ZIGBEE_StackLayersInit(void);
static void APP_ZIGBEE_ConfigEndpoints(void);
static void APP_ZIGBEE_NwkForm(void);
static void APP_ZIGBEE_PermitJoin(void);
static void APP_ZIGBEE_SW2_Process(void);
static void APP_ZIGBEE_ZbZdoPermitJoinReq_cb(struct ZbZdoPermitJoinRspT* rsp, void* arg);
static void APP_ZIGBEE_ConfigGroupAddr(void);
static void APP_ZIGBEE_TraceError(const char *pMess, uint32_t ErrCode);
static void APP_ZIGBEE_CheckWirelessFirmwareInfo(void);
static int APP_ZIGBEE_DeviceAnnce_cb(struct ZigBeeT *zb, struct ZbZdoDeviceAnnceT *annce,
uint8_t seqno, void *arg);
static void APP_ZIGBEE_ActiveEpRsp(struct ZbZdoActiveEpRspT *rsp, void *arg);
static void APP_ZIGBEE_SimpleDescRsp(struct ZbZdoSimpleDescRspT *rsp, void *arg);
static void APP_ZIGBEE_OnOffClientCallback(struct ZbZclCommandRspT *rsp, void *arg);
static void APP_ZIGBEE_ReadBasicInfo(void);
static void APP_ZIGBEE_BasicReadCallback(const struct ZbZclReadRspT *readRsp, void *arg);
static enum ZclStatusCodeT APP_ZIGBEE_TuyaCommand(struct ZbZclClusterT *cluster,
struct ZbZclHeaderT *zclHdrPtr,
struct ZbApsdeDataIndT *dataIndPtr);
static void APP_ZIGBEE_TuyaDumpPayload(const uint8_t *payload, uint16_t len);
static void APP_ZIGBEE_TuyaDumpPayloadOneLine(const uint8_t *payload, uint16_t len);
static uint32_t APP_ZIGBEE_TuyaReadUintBE(const uint8_t *data, uint16_t len);
static uint32_t APP_ZIGBEE_ComputePowerX10(uint16_t voltage_dv, uint32_t current_ma, uint32_t power_w);
static void ParseTuya_PowerData(const uint8_t *data, uint8_t len);
static void ParseTuya_TemperatureData(uint8_t dp_id, const uint8_t *data, uint8_t len);
static bool IsTuya_TemperatureDP(uint8_t dp_id);
static unsigned int APP_ZIGBEE_TuyaParseDpList(const uint8_t *payload, uint16_t len, uint16_t start_offset);
static void APP_ZIGBEE_HandleTuyaCurrent(uint8_t *payload, uint16_t length);
static void APP_ZIGBEE_TuyaQueryPowerData(void);
static void APP_ZIGBEE_TuyaBindReq(uint8_t endpoint);
static void APP_ZIGBEE_TuyaBindRsp(struct ZbZdoBindRspT *rsp, void *arg);
static void APP_ZIGBEE_TuyaIeeeAddrReq(uint16_t nwk_addr);
static void APP_ZIGBEE_TuyaIeeeAddrRsp(struct ZbZdoIeeeAddrRspT *rsp, void *arg);
static void APP_ZIGBEE_TuyaSendDpCommand(uint8_t dp_id, uint8_t dp_type, const uint8_t *dp_data, uint16_t dp_len);
static void APP_ZIGBEE_TuyaControlBreaker(bool on);
static void APP_ZIGBEE_UpdateBreakerStatus(bool on);
static void APP_ZIGBEE_UpdatePowerDisplay(void);
static void APP_ZIGBEE_TuyaQueryPowerTask(void);
static void APP_ZIGBEE_TuyaQueryTimerCallback(void);
static void APP_ZIGBEE_MqttControlCallback(const char *topic, const char *payload, uint16_t len);
static int APP_ZIGBEE_ApsSniffer(struct ZbApsdeDataIndT *dataInd, void *arg);
static uint32_t APP_ZIGBEE_GetTimestampSeconds(void);
static void APP_ZIGBEE_MqttUploadJson(void);

static void Wait_Getting_Ack_From_M0(void);
static void Receive_Ack_From_M0(void);
static void Receive_Notification_From_M0(void);
static void APP_ZIGBEE_ProcessNotifyM0ToM4(void);
static void APP_ZIGBEE_ProcessRequestM0ToM4(void);

