csmdqq-source/pv-iot-project/stm32-firmware/Zigbee_OnOff_Server_Coord/STM32_WPAN/App/app_zigbee.c
/* Private variables -----------------------------------------------*/
static TL_CmdPacket_t *p_ZIGBEE_otcmdbuffer;
static TL_EvtPacket_t *p_ZIGBEE_notif_M0_to_M4;
static TL_EvtPacket_t *p_ZIGBEE_request_M0_to_M4;
static __IO uint32_t CptReceiveNotifyFromM0 = 0;
static __IO uint32_t CptReceiveRequestFromM0 = 0;

/* USER CODE BEGIN PV */
static uint32_t g_unix_time_base = 0U;
static uint32_t g_unix_time_tick = 0U;
static bool g_unix_time_valid = false;
static uint8_t g_tuya_temperature_dp_id = 131U;     /* 主温度 DP，当前日志最像温度的是 131 -> 30.7C */
static uint8_t g_tuya_temperature_dp_alt1 = 101U;   /* 备用温度 DP 1 */
static uint8_t g_tuya_temperature_dp_alt2 = 133U;   /* 备用温度 DP 2 */
static uint8_t g_tuya_temperature_scale = 10U;      /* 10=原始值单位 0.1°C，1=原始值单位 1°C */
static bool g_tuya_temperature_auto_detect = true;  /* true=允许备用 DP 自动接管 */
/* USER CODE END PV */

PLACE_IN_SECTION("MB_MEM1") ALIGN(4) static TL_ZIGBEE_Config_t ZigbeeConfigBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t ZigbeeOtCmdBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ZigbeeNotifRspEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ZigbeeNotifRequestBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];
uint8_t g_ot_notification_allowed = 0U;

struct zigbee_app_info
{
struct ZigBeeT *zb;
enum ZbStartType startupControl;
enum ZbStatusCodeT join_status;
uint32_t join_delay;
bool init_after_join;
bool has_init;

struct ZbZclClusterT *onOff_server;
struct ZbZclClusterT *onOff_client;
struct ZbZclClusterT *basic_client;
struct ZbZclClusterT *tuya_client;
struct ZbZdoFilterT *device_annce_filter;
struct ZbApsFilterT *aps_sniffer_filter;
uint16_t last_joined_nwkAddr;
uint64_t last_joined_extAddr;
uint8_t last_joined_endpoint;
bool tuya_bound;
uint8_t tuya_endpoint_pending;
bool breaker_on; // 鏂矾鍣ㄥ綋鍓嶇姸鎬侊細true=闂悎(ON), false=鏂紑(OFF)

/* USER CODE BEGIN - Tuya Power Data */
uint16_t tuya_voltage_dv;    // 鐢靛帇锛屽崟浣嶏細0.1V (decivolt)
uint32_t tuya_current_ma;    // 鐢垫祦锛屽崟浣嶏細mA
uint32_t tuya_power_w;       // 鍔熺巼锛屽崟浣嶏細W
uint8_t tuya_query_timer_id; // 瀹氭椂鍣↖D锛岀敤浜庡懆鏈熸€ф煡璇㈠姛鐜囨暟鎹?
/* USER CODE END - Tuya Power Data */

/* USER CODE BEGIN - Tuya Temperature Data */
uint16_t tuya_temperature_x10;  // 温度，单位：0.1°C，例如 353 = 35.3°C
bool tuya_temperature_valid;    // 是否已收到真实温度
uint8_t tuya_temperature_dp_id; // 当前实际生效的温度 DP ID，便于调试
/* USER CODE END - Tuya Temperature Data */
};
static struct zigbee_app_info zigbee_app_info;


/* Clusters definition ---------------------------------------------------------*/
/* OnOff server 1 custom callbacks */
static enum ZclStatusCodeT onOff_server_off_cb(struct ZbZclClusterT *cluster, struct ZbZclAddrInfoT *srcInfo, void *arg);
static enum ZclStatusCodeT onOff_server_on_cb(struct ZbZclClusterT *cluster, struct ZbZclAddrInfoT *srcInfo, void *arg);
static enum ZclStatusCodeT onOff_server_toggle_cb(struct ZbZclClusterT *cluster, struct ZbZclAddrInfoT *srcInfo, void *arg);

static struct ZbZclOnOffServerCallbacksT OnOffServerCallbacks = {
.off = onOff_server_off_cb,
.on = onOff_server_on_cb,
.toggle = onOff_server_toggle_cb,
};

/* Functions Definition ------------------------------------------------------*/

/**
* @brief OnOff server off command callback
* @param clusterPtr pointer to cluster
* @param srcInfo source addr of the device that send the command
* @param arg extra arg
* @retval stack status code
*/
static enum ZclStatusCodeT onOff_server_off_cb(struct ZbZclClusterT *clusterPtr, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
uint8_t endpoint;

endpoint = ZbZclClusterGetEndpoint(clusterPtr);
if (endpoint == SW1_ENDPOINT)
{
APP_DBG("ZCL CB - LED OFF");
HAL_Delay(10);
LED_Off();
(void)ZbZclAttrIntegerWrite(clusterPtr, ZCL_ONOFF_ATTR_ONOFF, 0);
}
else
{
APP_DBG("Unknown endpoint");
return ZCL_STATUS_FAILURE;
}
return ZCL_STATUS_SUCCESS;
} /* onOff_server_off_cb */

/**
* @brief OnOff server on command callback
* @param clusterPtr pointer to cluster
* @param srcInfo source addr
* @param arg extra arg
* @retval stack status code
*/
static enum ZclStatusCodeT onOff_server_on_cb(struct ZbZclClusterT *clusterPtr, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
uint8_t endpoint;

endpoint = ZbZclClusterGetEndpoint(clusterPtr);
if (endpoint == SW1_ENDPOINT)
{
APP_DBG("ZCL CB - LED ON");
HAL_Delay(10);
LED_On();
(void)ZbZclAttrIntegerWrite(clusterPtr, ZCL_ONOFF_ATTR_ONOFF, 1);
}
else
{
APP_DBG("Unknown endpoint");
return ZCL_STATUS_FAILURE;
}
return ZCL_STATUS_SUCCESS;
} /* onOff_server_on_cb */

/**
* @brief OnOff server toggle 1 command callback
* @param clusterPtr pointer to cluster
* @param srcInfo source addr
* @param arg extra arg
* @retval stack status code
*/
static enum ZclStatusCodeT onOff_server_toggle_cb(struct ZbZclClusterT *clusterPtr, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
uint8_t attrVal;

if (ZbZclAttrRead(clusterPtr, ZCL_ONOFF_ATTR_ONOFF, NULL,
&attrVal, sizeof(attrVal), false) != ZCL_STATUS_SUCCESS)
{
return ZCL_STATUS_FAILURE;
}

if (attrVal != 0)
{
return onOff_server_off_cb(clusterPtr, srcInfo, arg);
}
else
{
return onOff_server_on_cb(clusterPtr, srcInfo, arg);
}
} /* onOff_server_toggle_cb */


/**
* @brief Zigbee application initialization
* @param None
* @retval None
*/
void APP_ZIGBEE_Init(void)
{
SHCI_CmdStatus_t ZigbeeInitStatus;

APP_DBG("APP_ZIGBEE_Init");

/* Check the compatibility with the Coprocessor Wireless Firmware loaded */
APP_ZIGBEE_CheckWirelessFirmwareInfo();

/* Register cmdbuffer */
APP_ZIGBEE_RegisterCmdBuffer(&ZigbeeOtCmdBuffer);

/* Init config buffer and call TL_ZIGBEE_Init */
APP_ZIGBEE_TL_INIT();

/* Register task */
/* Create the different tasks */

UTIL_SEQ_RegTask(1U << (uint32_t)CFG_TASK_NOTIFY_FROM_M0_TO_M4, UTIL_SEQ_RFU, APP_ZIGBEE_ProcessNotifyM0ToM4);
UTIL_SEQ_RegTask(1U << (uint32_t)CFG_TASK_REQUEST_FROM_M0_TO_M4, UTIL_SEQ_RFU, APP_ZIGBEE_ProcessRequestM0ToM4);

/* Task associated with network creation process */
UTIL_SEQ_RegTask(1U << CFG_TASK_ZIGBEE_NETWORK_FORM, UTIL_SEQ_RFU, APP_ZIGBEE_NwkForm);

/* Task associated with button action */
UTIL_SEQ_RegTask(1U << CFG_TASK_BUTTON_SW1, UTIL_SEQ_RFU, APP_ZIGBEE_PermitJoin);
UTIL_SEQ_RegTask(1U << CFG_TASK_BUTTON_SW2, UTIL_SEQ_RFU, APP_ZIGBEE_SW2_Process);
/* USER CODE BEGIN APP_ZIGBEE_INIT */
/* Task for periodic Tuya power query */
UTIL_SEQ_RegTask(1U << CFG_TASK_TUYA_QUERY_POWER, UTIL_SEQ_RFU, APP_ZIGBEE_TuyaQueryPowerTask);
/* A7670E cellular modem (AT + MQTT) */
A7670E_Init();
/* Subscribe to control topic for remote breaker commands */
A7670E_SetSubscribeTopic("pv/device_001/control");
A7670E_RegisterMsgCallback(APP_ZIGBEE_MqttControlCallback);
/* USER CODE END APP_ZIGBEE_INIT */

/* Start the Zigbee on the CPU2 side */
ZigbeeInitStatus = SHCI_C2_ZIGBEE_Init();
/* Prevent unused argument(s) compilation warning */
UNUSED(ZigbeeInitStatus);

/* Initialize Zigbee stack layers */
APP_ZIGBEE_StackLayersInit();

} /* APP_ZIGBEE_Init */

/**
* @brief Initialize Zigbee stack layers
* @param None
* @retval None
*/
static void APP_ZIGBEE_StackLayersInit(void)
{
APP_DBG("APP_ZIGBEE_StackLayersInit");

zigbee_app_info.zb = ZbInit(0U, NULL, NULL);
assert(zigbee_app_info.zb != NULL);

// 鍒濆鍖?Tuya 鐩稿叧鍙橀噺
zigbee_app_info.tuya_bound = false;
zigbee_app_info.tuya_endpoint_pending = 0;
zigbee_app_info.last_joined_nwkAddr = 0xFFFF;
zigbee_app_info.last_joined_extAddr = 0;
zigbee_app_info.last_joined_endpoint = 0;
zigbee_app_info.breaker_on = false; // 鍒濆鐘舵€侊細鏂紑

/* USER CODE BEGIN - Initialize Power Data */
zigbee_app_info.tuya_voltage_dv = 0U;
zigbee_app_info.tuya_current_ma = 0U;
zigbee_app_info.tuya_power_w = 0U;
zigbee_app_info.tuya_query_timer_id = 0U;
zigbee_app_info.tuya_temperature_x10 = 0U;
zigbee_app_info.tuya_temperature_valid = false;
zigbee_app_info.tuya_temperature_dp_id = 0U;

