csmdqq-source/pv-iot-project/stm32-firmware/Zigbee_OnOff_Server_Coord/STM32_WPAN/App/app_zigbee.c
/* 鍒涘缓鍛ㄦ湡鎬ф煡璇㈠畾鏃跺櫒 */
HW_TS_Create(CFG_TIM_PROC_ID_ISR, &zigbee_app_info.tuya_query_timer_id,
             hw_ts_Repeated, APP_ZIGBEE_TuyaQueryTimerCallback);
/* USER CODE END - Initialize Power Data */

APP_DBG("Tuya variables initialized");

// 鏄剧ず鍒濆鐘舵€?
BSP_LCD_Clear(LCD_Inst, SSD1315_COLOR_BLACK);
UTIL_LCD_DisplayStringAt(0, 0, (uint8_t*)"Zigbee Breaker", CENTER_MODE);
UTIL_LCD_DisplayStringAt(0, 16, (uint8_t*)"Initializing...", CENTER_MODE);
BSP_LCD_Refresh(LCD_Inst);

// 璁剧疆鍒濆 LED 鐘舵€侊紙钃濊壊=鏂紑锛?
LED_Set_rgb(PWM_LED_GSDATA_OFF, PWM_LED_GSDATA_OFF, PWM_LED_GSDATA_47_0);

zigbee_app_info.device_annce_filter = ZbZdoDeviceAnnceFilterRegister(
zigbee_app_info.zb, APP_ZIGBEE_DeviceAnnce_cb, NULL);
if (zigbee_app_info.device_annce_filter == NULL) {
APP_DBG("Device Announce filter registration failed");
}

/* Create the endpoint and cluster(s) */
APP_ZIGBEE_ConfigEndpoints();

/* 娉ㄥ唽 APS 灞傝繃婊ゅ櫒锛堟姄鍙栨墍鏈夊彂寰€ SNIFFER_ENDPOINT 鐨勬姤鏂囷級 */
zigbee_app_info.aps_sniffer_filter = ZbApsFilterEndpointAdd(
zigbee_app_info.zb,
SNIFFER_ENDPOINT,
ZCL_PROFILE_HOME_AUTOMATION,  // Profile ID (0x0104)
APP_ZIGBEE_ApsSniffer,
NULL
);
if (zigbee_app_info.aps_sniffer_filter == NULL) {
APP_DBG("ERROR: APS Sniffer filter registration failed!");
} else {
APP_DBG("APS Sniffer filter registered (EP=%u)", SNIFFER_ENDPOINT);
}

/* USER CODE BEGIN APP_ZIGBEE_StackLayersInit */
/* USER CODE END APP_ZIGBEE_StackLayersInit */

/* Configure the joining parameters */
zigbee_app_info.join_status = (enum ZbStatusCodeT) 0x01; /* init to error status */
zigbee_app_info.join_delay = HAL_GetTick(); /* now */
zigbee_app_info.startupControl = ZbStartTypeForm;

/* Text Feature */
BSP_LCD_Clear(LCD_Inst, SSD1315_COLOR_BLACK);
BSP_LCD_Refresh(LCD_Inst);
UTIL_LCD_DisplayStringAt(0, LINE(0), (uint8_t *)"OnOff Server Coord", CENTER_MODE);
BSP_LCD_Refresh(LCD_Inst);

/* Initialization Complete */
zigbee_app_info.has_init = true;

/* run the task */
UTIL_SEQ_SetTask(1U << CFG_TASK_ZIGBEE_NETWORK_FORM, CFG_SCH_PRIO_0);
} /* APP_ZIGBEE_StackLayersInit */

/**
* @brief Configure and register Zigbee application endpoints, onoff callbacks
* @param None
* @retval None
*/
static void APP_ZIGBEE_ConfigEndpoints(void)
{
struct ZbApsmeAddEndpointReqT req;
struct ZbApsmeAddEndpointConfT conf;

/* Endpoint: SNIFFER_ENDPOINT (鐢ㄤ簬鎺ユ敹 Tuya 鎶ユ枃) */
memset(&req, 0, sizeof(req));
req.profileId = ZCL_PROFILE_HOME_AUTOMATION;
req.deviceId = ZCL_DEVICE_ONOFF_SWITCH;
req.endpoint = SNIFFER_ENDPOINT;
ZbZclAddEndpoint(zigbee_app_info.zb, &req, &conf);
assert(conf.status == ZB_STATUS_SUCCESS);
APP_DBG("Registered SNIFFER_ENDPOINT=%u", SNIFFER_ENDPOINT);

/* Endpoint: SW1_ENDPOINT */
memset(&req, 0, sizeof(req));
req.profileId = ZCL_PROFILE_HOME_AUTOMATION;
req.deviceId = ZCL_DEVICE_ONOFF_SWITCH;
req.endpoint = SW1_ENDPOINT;
ZbZclAddEndpoint(zigbee_app_info.zb, &req, &conf);
assert(conf.status == ZB_STATUS_SUCCESS);

/* OnOff server */
zigbee_app_info.onOff_server = ZbZclOnOffServerAlloc(zigbee_app_info.zb, SW1_ENDPOINT, &OnOffServerCallbacks, NULL);
assert(zigbee_app_info.onOff_server != NULL);
ZbZclClusterEndpointRegister(zigbee_app_info.onOff_server);

/* OnOff client */
zigbee_app_info.onOff_client = ZbZclOnOffClientAlloc(zigbee_app_info.zb, SW1_ENDPOINT);
assert(zigbee_app_info.onOff_client != NULL);
ZbZclClusterEndpointRegister(zigbee_app_info.onOff_client);

/* Basic client (for reading manufacturer/model info) */
zigbee_app_info.basic_client = ZbZclBasicClientAlloc(zigbee_app_info.zb, SW1_ENDPOINT);
assert(zigbee_app_info.basic_client != NULL);
ZbZclClusterEndpointRegister(zigbee_app_info.basic_client);

/* Tuya (EF00) client for receiving DP reports */
zigbee_app_info.tuya_client = ZbZclClusterAlloc(zigbee_app_info.zb, sizeof(struct ZbZclClusterT),
(enum ZbZclClusterIdT)TUYA_CLUSTER_ID,
SW1_ENDPOINT, ZCL_DIRECTION_TO_CLIENT);
assert(zigbee_app_info.tuya_client != NULL);
zigbee_app_info.tuya_client->command = APP_ZIGBEE_TuyaCommand;
ZbZclClusterSetProfileId(zigbee_app_info.tuya_client, ZCL_PROFILE_HOME_AUTOMATION);
if (ZbZclClusterAttach(zigbee_app_info.tuya_client) != ZCL_STATUS_SUCCESS) {
APP_DBG("Tuya cluster attach failed");
} else {
ZbZclClusterEndpointRegister(zigbee_app_info.tuya_client);
}

/* USER CODE BEGIN CONFIG_ENDPOINT */
/* USER CODE END CONFIG_ENDPOINT */
} /* APP_ZIGBEE_ConfigEndpoints */

/**
* @brief Handle Zigbee network forming and joining
* @param None
* @retval None
*/
static void APP_ZIGBEE_NwkForm(void)
{
if ((zigbee_app_info.join_status != ZB_STATUS_SUCCESS) && (HAL_GetTick() >= zigbee_app_info.join_delay))
{
struct ZbStartupT config;
enum ZbStatusCodeT status;

/* Configure Zigbee Logging */
ZbSetLogging(zigbee_app_info.zb, ZB_LOG_MASK_LEVEL_5, NULL);

/* Attempt to join a zigbee network */
ZbStartupConfigGetProDefaults(&config);

/* Set the centralized network */
APP_DBG("Network config : APP_STARTUP_CENTRALIZED_COORDINATOR");
config.startupControl = zigbee_app_info.startupControl;

/* Using the default HA preconfigured Link Key */
memcpy(config.security.preconfiguredLinkKey, sec_key_ha, ZB_SEC_KEYSIZE);

config.channelList.count = 1;
config.channelList.list[0].page = 0;
config.channelList.list[0].channelMask = 1 << CHANNEL; /*Channel in use */

/* Using ZbStartupWait (blocking) */
status = ZbStartupWait(zigbee_app_info.zb, &config);

APP_DBG("ZbStartup Callback (status = 0x%02x)", status);
zigbee_app_info.join_status = status;

if (status == ZB_STATUS_SUCCESS)
{
/* USER CODE BEGIN 0 */
uint16_t short_addr = 0xffff;
uint64_t ext_addr = 0;

(void)ZbNwkGet(zigbee_app_info.zb, ZB_NWK_NIB_ID_NetworkAddress,
&short_addr, sizeof(short_addr));
ext_addr = ZbExtendedAddress(zigbee_app_info.zb);
APP_DBG("Ext Addr: 0x%016llx", (unsigned long long)ext_addr);
APP_DBG("Short Addr: 0x%04x", short_addr);

zigbee_app_info.join_delay = 0U;
zigbee_app_info.init_after_join = true;
/* flash x3 Green LED to inform the joining connection*/
LED_Set_rgb(PWM_LED_GSDATA_OFF, PWM_LED_GSDATA_47_0, PWM_LED_GSDATA_OFF);
HAL_Delay(500);
LED_Off();
HAL_Delay(500);
LED_Set_rgb(PWM_LED_GSDATA_OFF, PWM_LED_GSDATA_47_0, PWM_LED_GSDATA_OFF);
HAL_Delay(500);
LED_Off();
HAL_Delay(500);
LED_Set_rgb(PWM_LED_GSDATA_OFF, PWM_LED_GSDATA_47_0, PWM_LED_GSDATA_OFF);
HAL_Delay(500);
LED_Off();
HAL_Delay(500);
LED_Off();

