csmdqq-source/pv-iot-project/stm32-firmware/Zigbee_OnOff_Server_Coord/STM32_WPAN/App/app_zigbee.c
// 鏄剧ず缃戠粶灏辩华鐘舵€?
BSP_LCD_Clear(LCD_Inst, SSD1315_COLOR_BLACK);
UTIL_LCD_DisplayStringAt(0, 0, (uint8_t*)"Zigbee Breaker", CENTER_MODE);
UTIL_LCD_DisplayStringAt(0, 16, (uint8_t*)"Network Ready", CENTER_MODE);
UTIL_LCD_DisplayStringAt(0, 32, (uint8_t*)"Waiting device", CENTER_MODE);
BSP_LCD_Refresh(LCD_Inst);
}
else
{
/* USER CODE END 0 */
APP_DBG("Startup failed, attempting again after a short delay (%d ms)", APP_ZIGBEE_STARTUP_FAIL_DELAY);
zigbee_app_info.join_delay = HAL_GetTick() + APP_ZIGBEE_STARTUP_FAIL_DELAY;
}
}

/* If Network forming/joining was not successful reschedule the current task to retry the process */
if (zigbee_app_info.join_status != ZB_STATUS_SUCCESS)
{
UTIL_SEQ_SetTask(1U << CFG_TASK_ZIGBEE_NETWORK_FORM, CFG_SCH_PRIO_0);
}

/* USER CODE BEGIN NW_FORM */
else
{
zigbee_app_info.init_after_join = false;

/* Assign ourselves to the group addresses */
APP_ZIGBEE_ConfigGroupAddr();

/* Since we're using group addressing (broadcast), shorten the broadcast timeout */
uint32_t bcast_timeout = 3;
ZbNwkSet(zigbee_app_info.zb, ZB_NWK_NIB_ID_NetworkBroadcastDeliveryTime, &bcast_timeout, sizeof(bcast_timeout));
}
} /* APP_ZIGBEE_NwkForm */

static int APP_ZIGBEE_DeviceAnnce_cb(struct ZigBeeT *zb, struct ZbZdoDeviceAnnceT *annce,
uint8_t seqno, void *arg)
{
struct ZbZdoActiveEpReqT req;
enum ZbStatusCodeT status;

UNUSED(zb);
UNUSED(seqno);
UNUSED(arg);

// 淇濆瓨鍦板潃
zigbee_app_info.last_joined_nwkAddr = annce->nwkAddr;
zigbee_app_info.last_joined_extAddr = annce->extAddr;

APP_DBG("Device joined: 0x%04x", annce->nwkAddr);

memset(&req, 0, sizeof(req));
req.dstNwkAddr = annce->nwkAddr;
req.nwkAddrOfInterest = annce->nwkAddr;
ZbZdoActiveEpReq(zigbee_app_info.zb, &req, APP_ZIGBEE_ActiveEpRsp, NULL);

return ZB_APS_FILTER_CONTINUE;
}

static void APP_ZIGBEE_ActiveEpRsp(struct ZbZdoActiveEpRspT *rsp, void *arg)
{
UNUSED(arg);

if (rsp->status != ZB_STATUS_SUCCESS) {
return;
}

for (uint8_t i = 0; i < rsp->activeEpCount; i++) {
struct ZbZdoSimpleDescReqT req;

if (i == 0U) {
zigbee_app_info.last_joined_endpoint = rsp->activeEpList[i];
APP_DBG(">>> Saved endpoint: %u", rsp->activeEpList[i]);
}

memset(&req, 0, sizeof(req));
req.dstNwkAddr = rsp->nwkAddr;
req.nwkAddrOfInterest = rsp->nwkAddr;
req.endpt = rsp->activeEpList[i];
ZbZdoSimpleDescReq(zigbee_app_info.zb, &req, APP_ZIGBEE_SimpleDescRsp, NULL);
}
}

static void APP_ZIGBEE_SimpleDescRsp(struct ZbZdoSimpleDescRspT *rsp, void *arg)
{
UNUSED(arg);

if (rsp->status != ZB_STATUS_SUCCESS) {
APP_DBG("Simple Descriptor Response error: 0x%02x", rsp->status);
return;
}

bool has_tuya_cluster = false;

// 妫€鏌ユ槸鍚︽湁 Tuya 闆嗙兢
for (uint8_t i = 0; i < rsp->simpleDesc.inputClusterCount; i++) {
uint16_t cluster_id = rsp->simpleDesc.inputClusterList[i];

if (cluster_id == 0x0000U) {
APP_ZIGBEE_ReadBasicInfo();
}

if (cluster_id == TUYA_CLUSTER_ID) {
has_tuya_cluster = true;
APP_DBG("Tuya device detected (0xEF00)");
}
}

// 妫€娴嬪埌 Tuya 闆嗙兢鍚庯紝鑷姩缁戝畾
if (has_tuya_cluster && !zigbee_app_info.tuya_bound) {
zigbee_app_info.tuya_endpoint_pending = rsp->simpleDesc.endpoint;

if (zigbee_app_info.last_joined_extAddr != 0U) {
APP_ZIGBEE_TuyaBindReq(rsp->simpleDesc.endpoint);
} else {
APP_ZIGBEE_TuyaIeeeAddrReq(rsp->nwkAddr);
}
}
}

/*************************************************************
* ZbStartupWait Blocking Call
*************************************************************/
struct ZbStartupWaitInfo {
bool active;
enum ZbStatusCodeT status;
};

static void ZbStartupWaitCb(enum ZbStatusCodeT status, void *cb_arg)
{
struct ZbStartupWaitInfo *info = cb_arg;

info->status = status;
info->active = false;
UTIL_SEQ_SetEvt(EVENT_ZIGBEE_STARTUP_ENDED);
} /* ZbStartupWaitCb */

/**
* @brief startup wait function
* @param zb :Zigbee device object pointer, config: startup config pointer
* @param ErrCode
* @retval zigbee status stack code
*/
enum ZbStatusCodeT ZbStartupWait(struct ZigBeeT *zb, struct ZbStartupT *config)
{
struct ZbStartupWaitInfo *info;
enum ZbStatusCodeT status;

info = malloc(sizeof(struct ZbStartupWaitInfo));
if (info == NULL) {
return ZB_STATUS_ALLOC_FAIL;
}
memset(info, 0, sizeof(struct ZbStartupWaitInfo));

info->active = true;
status = ZbStartup(zb, config, ZbStartupWaitCb, info);
if (status != ZB_STATUS_SUCCESS)
{
free(info);
return status;
}
UTIL_SEQ_WaitEvt(EVENT_ZIGBEE_STARTUP_ENDED);
status = info->status;
free(info);
return status;
} /* ZbStartupWait */

/**
* @brief Trace the error or the warning reported.
* @param ErrId :
* @param ErrCode
* @retval None
*/
void APP_ZIGBEE_Error(uint32_t ErrId, uint32_t ErrCode)
{
switch (ErrId) {
default:
APP_ZIGBEE_TraceError("ERROR Unknown ", 0);
break;
}
} /* APP_ZIGBEE_Error */

/*************************************************************
*
* LOCAL FUNCTIONS
*
*************************************************************/

/**
* @brief Warn the user that an error has occurred.
*
* @param pMess : Message associated to the error.
* @param ErrCode: Error code associated to the module (Zigbee or other module if any)
* @retval None
*/
static void APP_ZIGBEE_TraceError(const char *pMess, uint32_t ErrCode)
{
APP_DBG("**** Fatal error = %s (Err = %d)", pMess, ErrCode);
/* USER CODE BEGIN TRACE_ERROR */
while (1U == 1U)
{
UTIL_LCD_ClearStringLine(4);
UTIL_LCD_DisplayStringAt(0, LINE(4), (uint8_t *)"FATAL_ERROR", CENTER_MODE);
BSP_LCD_Refresh(0);
}
/* USER CODE END TRACE_ERROR */

} /* APP_ZIGBEE_TraceError */

/**
* @brief Check if the Coprocessor Wireless Firmware loaded supports Zigbee
* and display associated information
* @param None
* @retval None
*/
static void APP_ZIGBEE_CheckWirelessFirmwareInfo(void)
{
WirelessFwInfo_t wireless_info_instance;
WirelessFwInfo_t *p_wireless_info = &wireless_info_instance;

if (SHCI_GetWirelessFwInfo(p_wireless_info) != SHCI_Success) {
APP_ZIGBEE_Error((uint32_t)ERR_ZIGBEE_CHECK_WIRELESS, (uint32_t)ERR_INTERFACE_FATAL);
}
else {
APP_DBG("**********************************************************");
APP_DBG("WIRELESS COPROCESSOR FW:");
/* Print version */
APP_DBG("VERSION ID = %d.%d.%d", p_wireless_info->VersionMajor, p_wireless_info->VersionMinor, p_wireless_info->VersionSub);

switch (p_wireless_info->StackType) {
case INFO_STACK_TYPE_ZIGBEE_FFD:
APP_DBG("FW Type : FFD Zigbee stack");
break;
case INFO_STACK_TYPE_ZIGBEE_RFD:
APP_DBG("FW Type : RFD Zigbee stack");
break;
default:
/* No Zigbee device supported ! */
APP_ZIGBEE_Error((uint32_t)ERR_ZIGBEE_CHECK_WIRELESS, (uint32_t)ERR_INTERFACE_FATAL);
break;
}
// print the application name
char* __PathProject__ =(strstr(__FILE__, "Zigbee") ? strstr(__FILE__, "Zigbee") + 7 : __FILE__);
char *del;
if ( (strchr(__FILE__, '/')) == NULL)
{del = strchr(__PathProject__, '\\');}
else
{del = strchr(__PathProject__, '/');}
int index = (int) (del - __PathProject__);
APP_DBG("Application flashed: %*.*s",index,index,__PathProject__);
//print channel
APP_DBG("Channel used: %d", CHANNEL);
//print Link Key
APP_DBG("Link Key: %.16s", sec_key_ha);
//print Link Key value hex
char Z09_LL_string[ZB_SEC_KEYSIZE*3+1];
Z09_LL_string[0]=0;
for(int str_index=0; str_index < ZB_SEC_KEYSIZE; str_index++)
{
sprintf(&Z09_LL_string[str_index*3],"%02x ",sec_key_ha[str_index]);
}
APP_DBG("Link Key value: %s",Z09_LL_string);
//print clusters allocated
APP_DBG("Clusters allocated are:");
APP_DBG("OnOff Server on Endpoint %d",SW1_ENDPOINT);
APP_DBG("**********************************************************");
}
} /* APP_ZIGBEE_CheckWirelessFirmwareInfo */

