csmdqq-source/pv-iot-project/stm32-firmware/Zigbee_OnOff_Server_Coord/STM32_WPAN/App/app_zigbee.c
/*************************************************************
*
* WRAP FUNCTIONS
*
*************************************************************/

void APP_ZIGBEE_RegisterCmdBuffer(TL_CmdPacket_t *p_buffer)
{
p_ZIGBEE_otcmdbuffer = p_buffer;
} /* APP_ZIGBEE_RegisterCmdBuffer */

Zigbee_Cmd_Request_t * ZIGBEE_Get_OTCmdPayloadBuffer(void)
{
return (Zigbee_Cmd_Request_t *)p_ZIGBEE_otcmdbuffer->cmdserial.cmd.payload;
} /* ZIGBEE_Get_OTCmdPayloadBuffer */

Zigbee_Cmd_Request_t * ZIGBEE_Get_OTCmdRspPayloadBuffer(void)
{
return (Zigbee_Cmd_Request_t *)((TL_EvtPacket_t *)p_ZIGBEE_otcmdbuffer)->evtserial.evt.payload;
} /* ZIGBEE_Get_OTCmdRspPayloadBuffer */

Zigbee_Cmd_Request_t * ZIGBEE_Get_NotificationPayloadBuffer(void)
{
return (Zigbee_Cmd_Request_t *)(p_ZIGBEE_notif_M0_to_M4)->evtserial.evt.payload;
} /* ZIGBEE_Get_NotificationPayloadBuffer */

Zigbee_Cmd_Request_t * ZIGBEE_Get_M0RequestPayloadBuffer(void)
{
return (Zigbee_Cmd_Request_t *)(p_ZIGBEE_request_M0_to_M4)->evtserial.evt.payload;
}

/**
* @brief This function is used to transfer the commands from the M4 to the M0.
* @param None
* @return None
*/
void ZIGBEE_CmdTransfer(void)
{
Zigbee_Cmd_Request_t *cmd_req = (Zigbee_Cmd_Request_t *)p_ZIGBEE_otcmdbuffer->cmdserial.cmd.payload;

/* Zigbee OT command cmdcode range 0x280 .. 0x3DF = 352 */
p_ZIGBEE_otcmdbuffer->cmdserial.cmd.cmdcode = 0x280U;
/* Size = otCmdBuffer->Size (Number of OT cmd arguments : 1 arg = 32bits so multiply by 4 to get size in bytes)
* + ID (4 bytes) + Size (4 bytes) */
p_ZIGBEE_otcmdbuffer->cmdserial.cmd.plen = 8U + (cmd_req->Size * 4U);

TL_ZIGBEE_SendM4RequestToM0();

/* Wait completion of cmd */
Wait_Getting_Ack_From_M0();
} /* ZIGBEE_CmdTransfer */

/**
* @brief This function is used to transfer the commands from the M4 to the M0 with notification
*
* @param None
* @return None
*/
void ZIGBEE_CmdTransferWithNotif(void)
{
g_ot_notification_allowed = 1;
ZIGBEE_CmdTransfer();
}

/**
* @brief This function is called when the M0+ acknowledge the fact that it has received a Cmd
* @param Otbuffer : a pointer to TL_EvtPacket_t
* @return None
*/
void TL_ZIGBEE_CmdEvtReceived(TL_EvtPacket_t *Otbuffer)
{
/* Prevent unused argument(s) compilation warning */
UNUSED(Otbuffer);

Receive_Ack_From_M0();
} /* TL_ZIGBEE_CmdEvtReceived */

/**
* @brief This function is called when notification from M0+ is received.
* @param Notbuffer : a pointer to TL_EvtPacket_t
* @return None
*/
void TL_ZIGBEE_NotReceived(TL_EvtPacket_t *Notbuffer)
{
p_ZIGBEE_notif_M0_to_M4 = Notbuffer;

Receive_Notification_From_M0();
} /* TL_ZIGBEE_NotReceived */

/**
* @brief This function is called before sending any ot command to the M0
* core. The purpose of this function is to be able to check if
* there are no notifications coming from the M0 core which are
* pending before sending a new ot command.
* @param None
* @retval None
*/
void Pre_ZigbeeCmdProcessing(void)
{
UTIL_SEQ_WaitEvt(EVENT_SYNCHRO_BYPASS_IDLE);
} /* Pre_ZigbeeCmdProcessing */

/**
* @brief This function waits for getting an acknowledgment from the M0.
* @param None
* @retval None
*/
static void Wait_Getting_Ack_From_M0(void)
{
UTIL_SEQ_WaitEvt(EVENT_ACK_FROM_M0_EVT);
} /* Wait_Getting_Ack_From_M0 */

/**
* @brief Receive an acknowledgment from the M0+ core.
* Each command send by the M4 to the M0 are acknowledged.
* This function is called under interrupt.
* @param None
* @retval None
*/
static void Receive_Ack_From_M0(void)
{
UTIL_SEQ_SetEvt(EVENT_ACK_FROM_M0_EVT);
} /* Receive_Ack_From_M0 */

/**
* @brief Receive a notification from the M0+ through the IPCC.
* This function is called under interrupt.
* @param None
* @retval None
*/
static void Receive_Notification_From_M0(void)
{
CptReceiveNotifyFromM0++;
UTIL_SEQ_SetTask(1U << (uint32_t)CFG_TASK_NOTIFY_FROM_M0_TO_M4, CFG_SCH_PRIO_0);
}

/**
* @brief This function is called when a request from M0+ is received.
* @param Notbuffer : a pointer to TL_EvtPacket_t
* @return None
*/
void TL_ZIGBEE_M0RequestReceived(TL_EvtPacket_t *Reqbuffer)
{
p_ZIGBEE_request_M0_to_M4 = Reqbuffer;

CptReceiveRequestFromM0++;
UTIL_SEQ_SetTask(1U << (uint32_t)CFG_TASK_REQUEST_FROM_M0_TO_M4, CFG_SCH_PRIO_0);
}

/**
* @brief Perform initialization of TL for Zigbee.
* @param None
* @retval None
*/
void APP_ZIGBEE_TL_INIT(void)
{
ZigbeeConfigBuffer.p_ZigbeeOtCmdRspBuffer = (uint8_t *)&ZigbeeOtCmdBuffer;
ZigbeeConfigBuffer.p_ZigbeeNotAckBuffer = (uint8_t *)ZigbeeNotifRspEvtBuffer;
ZigbeeConfigBuffer.p_ZigbeeNotifRequestBuffer = (uint8_t *)ZigbeeNotifRequestBuffer;
TL_ZIGBEE_Init(&ZigbeeConfigBuffer);
}

/**
* @brief Process the messages coming from the M0.
* @param None
* @retval None
*/
static void APP_ZIGBEE_ProcessNotifyM0ToM4(void)
{
if (CptReceiveNotifyFromM0 != 0)
{
/* Reset counter */
CptReceiveNotifyFromM0 = 0;
Zigbee_CallBackProcessing();
}
}

/**
* @brief Process the requests coming from the M0.
* @param None
* @return None
*/
static void APP_ZIGBEE_ProcessRequestM0ToM4(void)
{
if (CptReceiveRequestFromM0 != 0) {
CptReceiveRequestFromM0 = 0;
Zigbee_M0RequestProcessing();
}
}
/* USER CODE BEGIN FD_LOCAL_FUNCTIONS */

/**
* @brief Set group addressing mode
* @param None
* @retval None
*/
static void APP_ZIGBEE_ConfigGroupAddr(void)
{
struct ZbApsmeAddGroupReqT req;
struct ZbApsmeAddGroupConfT conf;

memset(&req, 0, sizeof(req));
req.endpt = SW1_ENDPOINT;
req.groupAddr = SW1_GROUP_ADDR;
ZbApsmeAddGroupReq(zigbee_app_info.zb, &req, &conf);

} /* APP_ZIGBEE_ConfigGroupAddr */

/**
* @brief Send the request to NWK layer a Permit to Join the network
* @param None
* @retval None
*/
static void APP_ZIGBEE_PermitJoin(void)
{
struct ZbZdoPermitJoinReqT req;
enum ZbStatusCodeT status;

memset(&req, 0, sizeof(req));
req.destAddr = ZB_NWK_ADDR_BCAST_ROUTERS;
req.tcSignificance = true;
req.duration = PERMIT_JOIN_DELAY;

APP_DBG("Send command Permit join during %ds", PERMIT_JOIN_DELAY);
status = ZbZdoPermitJoinReq(zigbee_app_info.zb, &req, APP_ZIGBEE_ZbZdoPermitJoinReq_cb, NULL);
UNUSED(status);

UTIL_SEQ_WaitEvt(EVENT_ZIGBEE_PERMIT_JOIN_REQ_RSP);
}

