csmdqq-source/pv-iot-project/stm32-firmware/Zigbee_OnOff_Server_Coord/STM32_WPAN/App/app_zigbee.c
static void APP_ZIGBEE_ZbZdoPermitJoinReq_cb(struct ZbZdoPermitJoinRspT *rsp, void *arg)
{
UNUSED(arg);
if(rsp->status != ZB_STATUS_SUCCESS){
APP_DBG("Error, cannot set permit join duration");
} else {
APP_DBG("Permit join duration successfully changed.");
}
/* Unlock the waiting on this event */
UTIL_SEQ_SetEvt(EVENT_ZIGBEE_PERMIT_JOIN_REQ_RSP);
}

static void APP_ZIGBEE_SW2_Process(void)
{
struct ZbApsAddrT dst;
enum ZclStatusCodeT status;
static bool tuya_state = false; // 鐢ㄤ簬 Tuya 璁惧鐨勭姸鎬佸垏鎹?

if (zigbee_app_info.last_joined_nwkAddr == 0x0000 ||
zigbee_app_info.last_joined_nwkAddr == 0xffff ||
zigbee_app_info.last_joined_endpoint == 0U) {
APP_DBG("Error: Breaker not joined yet!");
return;
}

// 鏂瑰紡1: 鍏堝皾璇?Tuya 鍗忚鎺у埗
if (zigbee_app_info.tuya_bound) {
APP_DBG("");
APP_DBG("========================================");
APP_DBG("SW2 Pressed - Tuya Device Control");
APP_DBG("========================================");
APP_DBG("Binding Status: BOUND");
APP_DBG("Device Addr: 0x%04x", zigbee_app_info.last_joined_nwkAddr);
APP_DBG("Endpoint: %u", zigbee_app_info.last_joined_endpoint);
APP_DBG("========================================");
APP_DBG("");

// 鍒囨崲鏂矾鍣ㄧ姸鎬?
tuya_state = !tuya_state;
APP_DBG(">>> Toggling breaker to: %s", tuya_state ? "ON" : "OFF");
APP_ZIGBEE_TuyaControlBreaker(tuya_state);
APP_ZIGBEE_TuyaQueryPowerData();

return;
} else {
APP_DBG("");
APP_DBG("========================================");
APP_DBG("WARNING: Tuya device NOT bound yet!");
APP_DBG("========================================");
APP_DBG("Cannot send Tuya commands");
APP_DBG("Please wait for device to join...");
APP_DBG("========================================");
APP_DBG("");
}

// 鏂瑰紡2: 濡傛灉涓嶆槸 Tuya 璁惧,浣跨敤鏍囧噯 OnOff 鍛戒护
memset(&dst, 0, sizeof(dst));
dst.mode = ZB_APSDE_ADDRMODE_SHORT;
dst.endpoint = zigbee_app_info.last_joined_endpoint;
dst.nwkAddr = zigbee_app_info.last_joined_nwkAddr;

APP_DBG("Sending OnOff Toggle to breaker 0x%04x:EP%d",
dst.nwkAddr, dst.endpoint);
status = ZbZclOnOffClientToggleReq(zigbee_app_info.onOff_client, &dst,
APP_ZIGBEE_OnOffClientCallback, NULL);

if (status != ZCL_STATUS_SUCCESS) {
APP_DBG("Error sending Toggle command: 0x%02x", status);
}
}

void APP_ZIGBEE_OnOffSend(uint8_t on)
{
struct ZbApsAddrT dst;
enum ZclStatusCodeT status;

if (zigbee_app_info.tuya_bound) {
APP_DBG("Using Tuya DP control for On/Off");
APP_ZIGBEE_TuyaControlBreaker(on != 0U);
return;
}

if (zigbee_app_info.last_joined_nwkAddr == 0x0000 ||
zigbee_app_info.last_joined_nwkAddr == 0xffff ||
zigbee_app_info.last_joined_endpoint == 0U) {
APP_DBG("Error: Breaker not joined yet!");
return;
}

memset(&dst, 0, sizeof(dst));
dst.mode = ZB_APSDE_ADDRMODE_SHORT;
dst.endpoint = zigbee_app_info.last_joined_endpoint;
dst.nwkAddr = zigbee_app_info.last_joined_nwkAddr;

if (on != 0U) {
APP_DBG("Sending OnOff ON to breaker 0x%04x:EP%d",
dst.nwkAddr, dst.endpoint);
status = ZbZclOnOffClientOnReq(zigbee_app_info.onOff_client, &dst,
APP_ZIGBEE_OnOffClientCallback, NULL);
} else {
APP_DBG("Sending OnOff OFF to breaker 0x%04x:EP%d",
dst.nwkAddr, dst.endpoint);
status = ZbZclOnOffClientOffReq(zigbee_app_info.onOff_client, &dst,
APP_ZIGBEE_OnOffClientCallback, NULL);
}

if (status != ZCL_STATUS_SUCCESS) {
APP_DBG("Error sending OnOff command: 0x%02x", status);
}
}

/* USER CODE BEGIN EF */
void APP_ZIGBEE_SetUnixTime(uint32_t unix_seconds)
{
  g_unix_time_base = unix_seconds;
  g_unix_time_tick = HAL_GetTick();
  g_unix_time_valid = true;
  APP_DBG("Unix time synced: %lu", (unsigned long)unix_seconds);
}
/* USER CODE END EF */

static void APP_ZIGBEE_OnOffClientCallback(struct ZbZclCommandRspT *rsp, void *arg)
{
UNUSED(arg);

APP_DBG("OnOff Client Response received:");
APP_DBG(" Status: 0x%02x", rsp->status);
APP_DBG(" From: 0x%04x", rsp->src.nwkAddr);
}

static void APP_ZIGBEE_ReadBasicInfo(void)
{
struct ZbZclReadReqT req;
enum ZclStatusCodeT status;

if (zigbee_app_info.last_joined_nwkAddr == 0x0000 ||
zigbee_app_info.last_joined_nwkAddr == 0xffff ||
zigbee_app_info.last_joined_endpoint == 0U) {
return;
}

memset(&req, 0, sizeof(req));
req.dst.mode = ZB_APSDE_ADDRMODE_SHORT;
req.dst.endpoint = zigbee_app_info.last_joined_endpoint;
req.dst.nwkAddr = zigbee_app_info.last_joined_nwkAddr;
req.count = 2;
req.attr[0] = ZCL_BASIC_ATTR_MFR_NAME;
req.attr[1] = ZCL_BASIC_ATTR_MODEL_NAME;

status = ZbZclReadReq(zigbee_app_info.basic_client, &req,
APP_ZIGBEE_BasicReadCallback, NULL);
if (status != ZCL_STATUS_SUCCESS) {
APP_DBG("Basic read request failed: 0x%02x", status);
}
}

static void APP_ZIGBEE_BasicReadCallback(const struct ZbZclReadRspT *readRsp, void *arg)
{
UNUSED(arg);

if (readRsp->status != ZCL_STATUS_SUCCESS) {
APP_DBG("Basic read response error: 0x%02x", readRsp->status);
return;
}

for (unsigned int i = 0; i < readRsp->count; i++) {
const struct ZbZclReadRspDataT *attr = &readRsp->attr[i];
if (attr->status != ZCL_STATUS_SUCCESS || attr->value == NULL) {
continue;
}
if ((attr->type == ZCL_DATATYPE_STRING_CHARACTER ||
attr->type == ZCL_DATATYPE_STRING_LONG_CHARACTER) &&
attr->length > 0U) {
uint8_t str_len = attr->value[0];
if (str_len > (attr->length - 1U)) {
str_len = (uint8_t)(attr->length - 1U);
}
if (attr->attrId == ZCL_BASIC_ATTR_MFR_NAME) {
APP_DBG("Manufacturer: %.*s", str_len, (const char *)&attr->value[1]);
} else if (attr->attrId == ZCL_BASIC_ATTR_MODEL_NAME) {
APP_DBG("Model: %.*s", str_len, (const char *)&attr->value[1]);
}
}
}
}

static enum ZclStatusCodeT APP_ZIGBEE_TuyaCommand(struct ZbZclClusterT *cluster,
struct ZbZclHeaderT *zclHdrPtr,
struct ZbApsdeDataIndT *dataIndPtr)
{
struct ZbZclHeaderT hdr;
int hdr_len;
const uint8_t *payload = NULL;
uint16_t payload_len = 0U;
unsigned int dp_count;

// 绔嬪嵆鎵撳嵃锛岀‘璁ゅ洖璋冭瑙﹀彂
TUYA_LOG("");
TUYA_LOG("****************************************");
TUYA_LOG("*** TUYA CALLBACK TRIGGERED! (0xEF00) ***");
TUYA_LOG("****************************************");

hdr_len = ZbZclParseHeader(&hdr, dataIndPtr->asdu, dataIndPtr->asduLength);
if (hdr_len < 0) {
TUYA_LOG("Tuya EF00: invalid ZCL header");
return ZCL_STATUS_MALFORMED_COMMAND;
}

payload = &dataIndPtr->asdu[hdr_len];
if (dataIndPtr->asduLength > (uint16_t)hdr_len) {
payload_len = (uint16_t)(dataIndPtr->asduLength - (uint16_t)hdr_len);
}

TUYA_LOG("========================================");
TUYA_LOG(">>> RECEIVED Tuya 0xEF00 Cluster Message!");
TUYA_LOG(">>> Source: NwkAddr=0x%04x, EP=%u",
dataIndPtr->src.nwkAddr, dataIndPtr->src.endpoint);
TUYA_LOG(">>> ZCL Command: 0x%02x", zclHdrPtr->cmdId);
TUYA_LOG(">>> Tuya CmdId (EF00): 0x%02x", zclHdrPtr->cmdId);
TUYA_LOG(">>> Total ASDU Length: %u bytes", dataIndPtr->asduLength);
TUYA_LOG(">>> ZCL Header Length: %d bytes", hdr_len);
TUYA_LOG(">>> Tuya Payload Length: %u bytes", payload_len);
TUYA_LOG("========================================");

// 鎵撳嵃瀹屾暣鐨勫師濮?ASDU锛堝寘鎷?ZCL Header + Payload锛?
#if TUYA_VERBOSE_LOG
APP_DBG("");
APP_DBG(">>> COMPLETE RAW ASDU (HEX):");
APP_DBG(">>> [Single Line - Easy to Copy]:");
APP_ZIGBEE_TuyaDumpPayloadOneLine(dataIndPtr->asdu, dataIndPtr->asduLength);
APP_DBG(">>> [Multi Line - Detailed View]:");
APP_ZIGBEE_TuyaDumpPayload(dataIndPtr->asdu, dataIndPtr->asduLength);

