csmdqq-source/pv-iot-project/stm32-firmware/Zigbee_OnOff_Server_Coord/STM32_WPAN/App/app_zigbee.c
// 鍗曠嫭鎵撳嵃 ZCL Header 閮ㄥ垎
APP_DBG("");
APP_DBG(">>> ZCL HEADER (HEX):");
APP_ZIGBEE_TuyaDumpPayloadOneLine(dataIndPtr->asdu, (uint16_t)hdr_len);

// 鍗曠嫭鎵撳嵃 Tuya Payload 閮ㄥ垎
APP_DBG("");
APP_DBG(">>> TUYA PAYLOAD (HEX):");
APP_ZIGBEE_TuyaDumpPayloadOneLine(payload, payload_len);
APP_DBG(">>> [Detailed View]:");
APP_ZIGBEE_TuyaDumpPayload(payload, payload_len);
#endif

APP_ZIGBEE_HandleTuyaCurrent((uint8_t *)payload, payload_len);

dp_count = APP_ZIGBEE_TuyaParseDpList(payload, payload_len, 2U);
if (dp_count == 0U) {
dp_count = APP_ZIGBEE_TuyaParseDpList(payload, payload_len, 1U);
}
if (dp_count == 0U) {
(void)APP_ZIGBEE_TuyaParseDpList(payload, payload_len, 0U);
}

return ZCL_STATUS_SUCCESS;
}

static void APP_ZIGBEE_TuyaBindReq(uint8_t endpoint)
{
struct ZbZdoBindReqT req;
enum ZbStatusCodeT status;
uint64_t coord_ext_addr;

if (zigbee_app_info.last_joined_nwkAddr == 0x0000 ||
zigbee_app_info.last_joined_nwkAddr == 0xffff ||
zigbee_app_info.last_joined_extAddr == 0U) {
APP_DBG("Bind request failed: invalid address");
return;
}

coord_ext_addr = ZbExtendedAddress(zigbee_app_info.zb);

memset(&req, 0, sizeof(req));
req.target = zigbee_app_info.last_joined_nwkAddr;
req.srcExtAddr = zigbee_app_info.last_joined_extAddr;
req.srcEndpt = endpoint;
req.clusterId = TUYA_CLUSTER_ID;
req.dst.mode = ZB_APSDE_ADDRMODE_EXT;
req.dst.extAddr = coord_ext_addr;
req.dst.endpoint = SW1_ENDPOINT;

status = ZbZdoBindReq(zigbee_app_info.zb, &req, APP_ZIGBEE_TuyaBindRsp, NULL);
if (status != ZB_STATUS_SUCCESS) {
APP_DBG("Bind request failed: 0x%02x", status);
}
}

static void APP_ZIGBEE_TuyaBindRsp(struct ZbZdoBindRspT *rsp, void *arg)
{
UNUSED(arg);

if (rsp->status == ZB_STATUS_SUCCESS) {
zigbee_app_info.tuya_bound = true;
APP_DBG("========================================");
APP_DBG("Tuya binding SUCCESS!");
APP_DBG("  Device: 0x%04x", zigbee_app_info.last_joined_nwkAddr);
APP_DBG("  Endpoint: %u", zigbee_app_info.tuya_endpoint_pending);
APP_DBG("  Cluster: 0xEF00");
APP_DBG("  Coordinator can now receive DP reports");
APP_DBG("========================================");

/* 绔嬪嵆鏌ヨ涓€娆″姛鐜囨暟鎹?*/
APP_ZIGBEE_TuyaQueryPowerData();

/* 鍚姩鍛ㄦ湡鎬ф煡璇㈠畾鏃跺櫒锛?绉掑懆鏈燂級 */
uint32_t timer_ticks = TUYA_QUERY_PERIOD_MS * 1000 / CFG_TS_TICK_VAL;
HW_TS_Start(zigbee_app_info.tuya_query_timer_id, timer_ticks);
APP_DBG("Tuya query timer started (period: %u ms)", TUYA_QUERY_PERIOD_MS);
} else {
APP_DBG("========================================");
APP_DBG("Tuya binding FAILED!");
APP_DBG("  Status: 0x%02x", rsp->status);
APP_DBG("  Cannot receive DP reports");
APP_DBG("========================================");
}
}

static void APP_ZIGBEE_TuyaIeeeAddrReq(uint16_t nwk_addr)
{
struct ZbZdoIeeeAddrReqT req;
enum ZbStatusCodeT status;

memset(&req, 0, sizeof(req));
req.dstNwkAddr = nwk_addr;
req.nwkAddrOfInterest = nwk_addr;
req.reqType = ZB_ZDO_ADDR_REQ_TYPE_SINGLE;
req.startIndex = 0U;

status = ZbZdoIeeeAddrReq(zigbee_app_info.zb, &req, APP_ZIGBEE_TuyaIeeeAddrRsp, NULL);
if (status != ZB_STATUS_SUCCESS) {
APP_DBG("IEEE addr request failed: 0x%02x", status);
}
}

static void APP_ZIGBEE_TuyaIeeeAddrRsp(struct ZbZdoIeeeAddrRspT *rsp, void *arg)
{
UNUSED(arg);

if (rsp->status != ZB_STATUS_SUCCESS) {
APP_DBG("IEEE addr response failed: 0x%02x", rsp->status);
return;
}

zigbee_app_info.last_joined_extAddr = rsp->extAddr;
zigbee_app_info.last_joined_nwkAddr = rsp->nwkAddr;

if (!zigbee_app_info.tuya_bound && zigbee_app_info.tuya_endpoint_pending != 0U) {
APP_ZIGBEE_TuyaBindReq(zigbee_app_info.tuya_endpoint_pending);
}
}

static void APP_ZIGBEE_TuyaDumpPayload(const uint8_t *payload, uint16_t len)
{
static const char hex[] = "0123456789ABCDEF";
char line[(3U * 16U) + 1U];
uint16_t offset = 0U;

if (payload == NULL || len == 0U) {
TUYA_LOG(" Payload: <empty>");
return;
}

while (offset < len) {
uint16_t chunk = (len - offset > 16U) ? 16U : (len - offset);
uint16_t pos = 0U;
for (uint16_t i = 0U; i < chunk; i++) {
uint8_t b = payload[offset + i];
line[pos++] = hex[b >> 4];
line[pos++] = hex[b & 0x0F];
if (i + 1U < chunk) {
line[pos++] = ' ';
}
}
line[pos] = '\0';
TUYA_LOG(" Payload[%u]: %s", offset, line);
offset = (uint16_t)(offset + chunk);
}
}

/**
* @brief 鍗曡杩炵画鎵撳嵃瀹屾暣鐨勫崄鍏繘鍒舵暟鎹紙鏂逛究澶嶅埗鍒嗘瀽锛?
* @param payload: 鏁版嵁鎸囬拡
* @param len: 鏁版嵁闀垮害
* @retval None
*/
static void APP_ZIGBEE_TuyaDumpPayloadOneLine(const uint8_t *payload, uint16_t len)
{
static const char hex[] = "0123456789ABCDEF";
char line[256]; // 鏈€澶氭樉绀虹害85瀛楄妭鏁版嵁
uint16_t pos = 0U;

if (payload == NULL || len == 0U) {
TUYA_LOG(" <empty>");
return;
}

// 闄愬埗鏈€澶ф樉绀洪暱搴︼紙閬垮厤缂撳啿鍖烘孩鍑猴級
uint16_t display_len = (len > 80U) ? 80U : len;

for (uint16_t i = 0U; i < display_len; i++) {
uint8_t b = payload[i];
line[pos++] = hex[b >> 4];
line[pos++] = hex[b & 0x0F];
if (i + 1U < display_len) {
line[pos++] = ' ';
}
}
line[pos] = '\0';

TUYA_LOG(" %s%s", line, (len > 80U) ? " ..." : "");
}

static uint32_t APP_ZIGBEE_TuyaReadUintBE(const uint8_t *data, uint16_t len)
{
uint32_t value = 0U;
if (data == NULL || len == 0U || len > 4U) {
return 0U;
}
for (uint16_t i = 0U; i < len; i++) {
value = (value << 8) | data[i];
}
return value;
}

static uint32_t APP_ZIGBEE_ComputePowerX10(uint16_t voltage_dv, uint32_t current_ma, uint32_t power_w)
{
  if (voltage_dv != 0U && current_ma != 0U) {
    return (uint32_t)((((uint64_t)voltage_dv * (uint64_t)current_ma) + 500U) / 1000U);
  }
  return power_w * 10U;
}

/**
 * @brief 瑙ｆ瀽娑傞甫 DP 6 鐢甸噺鏁版嵁锛堢數鍘嬨€佺數娴併€佸姛鐜囷級
 * @param data: 鎸囧悜8瀛楄妭鏁版嵁鐨勬寚閽?
 * @param len: 鏁版嵁闀垮害锛屽繀椤荤瓑浜?
 * @note 鏁版嵁鏍煎紡锛堝ぇ绔簭锛夛細
 *       Byte 0-1: 鐢靛帇 (uint16, 鍗曚綅 0.1V)
 *       Byte 2-4: 鐢垫祦 (uint24, 鍗曚綅 mA)
 *       Byte 5-7: 鍔熺巼 (uint24, 鍗曚綅 W)
 * @retval None
 */
static void ParseTuya_PowerData(const uint8_t *data, uint8_t len)
{
  /* parameter check */
  if (data == NULL) {
    APP_DBG("ERROR: ParseTuya_PowerData - NULL pointer");
    return;
  }

  if (len != 8U) {
    APP_DBG("ERROR: ParseTuya_PowerData - Invalid length %u (expected 8)", len);
    return;
  }

  /* Byte 0-1: voltage (uint16 BE, 0.1V) */
  uint16_t voltage_raw = ((uint16_t)data[0] << 8) | data[1];

  /* Byte 2-4: current (uint24 BE, mA) */
  uint32_t current_ma = ((uint32_t)data[2] << 16) |
                        ((uint32_t)data[3] << 8) |
                        data[4];

  /* Byte 5-7: power (uint24 BE, W) */
  uint32_t power_w = ((uint32_t)data[5] << 16) |
                     ((uint32_t)data[6] << 8) |
                     data[7];
  uint32_t power_x10 = APP_ZIGBEE_ComputePowerX10(voltage_raw, current_ma, power_w);

  /* save to global struct */
  zigbee_app_info.tuya_voltage_dv = voltage_raw;
  zigbee_app_info.tuya_current_ma = current_ma;
  zigbee_app_info.tuya_power_w = power_w;

