csmdqq-source/pv-iot-project/stm32-firmware/Zigbee_OnOff_Server_Coord/STM32_WPAN/App/app_zigbee.c
  APP_DBG("[POWER] V=%u.%uV I=%lumA P=%lu.%luW",
          voltage_raw / 10U, voltage_raw % 10U,
          (unsigned long)current_ma,
          (unsigned long)(power_x10 / 10U),
          (unsigned long)(power_x10 % 10U));

  /* 鏇存柊 LCD 鏄剧ず */
  APP_ZIGBEE_UpdatePowerDisplay();
}

static void ParseTuya_TemperatureData(uint8_t dp_id, const uint8_t *data, uint8_t len)
{
  uint32_t temp_raw;
  uint32_t temp_x10_raw;

  if (data == NULL || len == 0U || len > 4U) {
    APP_DBG("ERROR: ParseTuya_TemperatureData - Invalid params (len=%u)", len);
    return;
  }

  if (g_tuya_temperature_scale == 0U) {
    APP_DBG("ERROR: Temperature scale cannot be 0");
    return;
  }

  temp_raw = APP_ZIGBEE_TuyaReadUintBE(data, len);

  if (g_tuya_temperature_scale == 10U) {
    temp_x10_raw = temp_raw;
  } else if (g_tuya_temperature_scale == 1U) {
    temp_x10_raw = temp_raw * 10U;
  } else {
    temp_x10_raw = (temp_raw * 10U) / g_tuya_temperature_scale;
  }

  if (temp_x10_raw > 0xFFFFU) {
    temp_x10_raw = 0xFFFFU;
  }

  zigbee_app_info.tuya_temperature_x10 = (uint16_t)temp_x10_raw;
  zigbee_app_info.tuya_temperature_valid = true;
  zigbee_app_info.tuya_temperature_dp_id = dp_id;

  APP_DBG("[TEMP] DP=%u Raw=%lu -> %u.%uC",
          dp_id,
          (unsigned long)temp_raw,
          zigbee_app_info.tuya_temperature_x10 / 10U,
          zigbee_app_info.tuya_temperature_x10 % 10U);
}

static bool IsTuya_TemperatureDP(uint8_t dp_id)
{
  if (dp_id == g_tuya_temperature_dp_id) {
    return true;
  }

  if (zigbee_app_info.tuya_temperature_valid &&
      dp_id == zigbee_app_info.tuya_temperature_dp_id) {
    return true;
  }

  if (!g_tuya_temperature_auto_detect) {
    return false;
  }

  return (dp_id == g_tuya_temperature_dp_alt1) ||
         (dp_id == g_tuya_temperature_dp_alt2);
}

static void APP_ZIGBEE_HandleTuyaCurrent(uint8_t *payload, uint16_t length)
{
uint16_t idx = 0U;

if (payload == NULL || length < 8U) {
return;
}

while ((uint16_t)(idx + 7U) < length) {
if (payload[idx] == 0x7D && payload[idx + 1U] == 0x02) {
uint16_t dp_len = ((uint16_t)payload[idx + 2U] << 8) | payload[idx + 3U];
if (dp_len == 4U && (uint16_t)(idx + 7U) < length) {
uint32_t current_ma = ((uint32_t)payload[idx + 4U] << 24) |
((uint32_t)payload[idx + 5U] << 16) |
((uint32_t)payload[idx + 6U] << 8) |
payload[idx + 7U];
double current_a = (double)current_ma / 1000.0;
TUYA_LOG("Detected Current: %ld mA (%.3f A)", (long)current_ma, current_a);
return;
}
}
idx++;
}
}

static void APP_ZIGBEE_TuyaQueryPowerData(void)
{
struct ZbZclClusterCommandReqT req;
enum ZclStatusCodeT status;

if (zigbee_app_info.last_joined_nwkAddr == 0x0000 ||
zigbee_app_info.last_joined_nwkAddr == 0xffff ||
zigbee_app_info.last_joined_endpoint == 0U ||
!zigbee_app_info.tuya_bound) {
return;
}

memset(&req, 0, sizeof(req));
req.dst.mode = ZB_APSDE_ADDRMODE_SHORT;
req.dst.endpoint = TUYA_TARGET_ENDPOINT;
req.dst.nwkAddr = zigbee_app_info.last_joined_nwkAddr;
req.cmdId = 0x03;
req.noDefaultResp = ZCL_NO_DEFAULT_RESPONSE_FALSE;
req.payload = NULL;
req.length = 0U;

status = ZbZclClusterCommandReq(zigbee_app_info.tuya_client, &req, NULL, NULL);
if (status != ZCL_STATUS_SUCCESS) {
TUYA_LOG("Tuya query failed: 0x%02x", status);
}
}

static unsigned int APP_ZIGBEE_TuyaParseDpList(const uint8_t *payload, uint16_t len, uint16_t start_offset)
{
unsigned int count = 0U;
uint16_t idx = start_offset;

if (payload == NULL || len < (uint16_t)(start_offset + 4U)) {
return 0U;
}

TUYA_LOG("=== Parsing Tuya DP List ===");

while ((uint16_t)(idx + 4U) <= len) {
uint8_t dp_id = payload[idx];
uint8_t dp_type = payload[idx + 1U];
uint16_t dp_len = ((uint16_t)payload[idx + 2U] << 8) | payload[idx + 3U];
idx = (uint16_t)(idx + 4U);

if ((uint16_t)(idx + dp_len) > len) {
TUYA_LOG("DP parse truncated: id=%u type=0x%02x len=%u", dp_id, dp_type, dp_len);
break;
}

if (dp_id == 6U && dp_len == 8U) {
TUYA_LOG("--- DP #%u ---", count + 1U);
TUYA_LOG("DP ID: %u <<<===", dp_id);
TUYA_LOG("DP Type: 0x%02x (Power Data)", dp_type);
TUYA_LOG("DP Length: %u", dp_len);
TUYA_LOG("DP Raw:");
APP_ZIGBEE_TuyaDumpPayloadOneLine(&payload[idx], dp_len);
ParseTuya_PowerData(&payload[idx], (uint8_t)dp_len);
idx = (uint16_t)(idx + dp_len);
count++;
continue;
}

if (IsTuya_TemperatureDP(dp_id) && dp_len >= 1U && dp_len <= 4U) {
TUYA_LOG("--- DP #%u ---", count + 1U);
TUYA_LOG("DP ID: %u <<<===", dp_id);
TUYA_LOG("DP Type: 0x%02x (Temperature)", dp_type);
TUYA_LOG("DP Length: %u", dp_len);
TUYA_LOG("DP Raw:");
APP_ZIGBEE_TuyaDumpPayloadOneLine(&payload[idx], dp_len);
ParseTuya_TemperatureData(dp_id, &payload[idx], (uint8_t)dp_len);
idx = (uint16_t)(idx + dp_len);
count++;
continue;
}

// 璇︾粏鎵撳嵃 DP 淇℃伅
TUYA_LOG("--- DP #%u ---", count + 1);
TUYA_LOG("DP ID: %u <<<===", dp_id); // 楂樹寒鏄剧ずDP ID
TUYA_LOG("DP Type: 0x%02x (%s)", dp_type,
(dp_type == 0x01) ? "Boolean" :
(dp_type == 0x02) ? "Value" :
(dp_type == 0x03) ? "String" :
(dp_type == 0x04) ? "Enum" : "Unknown");
TUYA_LOG("DP Length: %u", dp_len);

// 瑙ｆ瀽鏁版嵁鍊?
if (dp_len > 0U) {
if (dp_type == 0x01 && dp_len == 1) {
// Boolean 绫诲瀷
TUYA_LOG("DP Raw:");
APP_ZIGBEE_TuyaDumpPayloadOneLine(&payload[idx], dp_len);
TUYA_LOG("DP Value (int): %u", payload[idx] ? 1U : 0U);
TUYA_LOG("DP Value (bool): %s", payload[idx] ? "TRUE" : "FALSE");

// DP ID 16: 鏂矾鍣ㄥ紑鍏崇姸鎬?
if (dp_id == 16) {
bool new_state = (payload[idx] != 0);
if (zigbee_app_info.breaker_on != new_state) {
APP_ZIGBEE_UpdateBreakerStatus(new_state);
}
}
} else if (dp_type == 0x02 || dp_type == 0x04) {
TUYA_LOG("DP Raw:");
APP_ZIGBEE_TuyaDumpPayloadOneLine(&payload[idx], dp_len);
if (dp_len <= 4U) {
uint32_t value = APP_ZIGBEE_TuyaReadUintBE(&payload[idx], dp_len);
TUYA_LOG("DP Value (int): %lu", (unsigned long)value);

/* USER CODE BEGIN - DP ID 6: 鐢甸噺鏁版嵁 */
// DP ID 6: 鐢靛帇銆佺數娴併€佸姛鐜囨暟鎹?
if (dp_id == 6 && dp_len == 8U) {
ParseTuya_PowerData(&payload[idx], (uint8_t)dp_len);
}
/* USER CODE END - DP ID 6 */
} else {
TUYA_LOG("DP Value (int): <len=%u too large>", dp_len);
}
} else {
// 鍏朵粬绫诲瀷,鎵撳嵃鍘熷鏁版嵁
TUYA_LOG("DP Raw:");
APP_ZIGBEE_TuyaDumpPayloadOneLine(&payload[idx], dp_len);
if (dp_len <= 4U) {
uint32_t value = APP_ZIGBEE_TuyaReadUintBE(&payload[idx], dp_len);
TUYA_LOG("DP Value (int): %lu", (unsigned long)value);

/* USER CODE BEGIN - DP ID 6: 鐢甸噺鏁版嵁锛堝鐢級 */
// DP ID 6: 鐢靛帇銆佺數娴併€佸姛鐜囨暟鎹紙濡傛灉绫诲瀷涓嶆槸0x02锛?
if (dp_id == 6 && dp_len == 8U) {
ParseTuya_PowerData(&payload[idx], (uint8_t)dp_len);
}
/* USER CODE END - DP ID 6 */
}
}
}

idx = (uint16_t)(idx + dp_len);
count++;
}

