csmdqq-source/pv-iot-project/stm32-firmware/Zigbee_OnOff_Server_Coord/STM32_WPAN/App/app_zigbee.c
TUYA_LOG("Total DPs found: %u", count);
return count;
}

/**
* @brief 鍙戦€?Tuya DP 鎺у埗鍛戒护(澧炲己鐗?- 澶氭牸寮忓皾璇?
* @param dp_id: DP ID
* @param dp_type: DP 鏁版嵁绫诲瀷 (0x01=Boolean, 0x02=Value, etc.)
* @param dp_data: DP 鏁版嵁鍐呭
* @param dp_len: DP 鏁版嵁闀垮害
* @retval None
*/
static void APP_ZIGBEE_TuyaSendDpCommand(uint8_t dp_id, uint8_t dp_type,
const uint8_t *dp_data, uint16_t dp_len)
{
struct ZbZclClusterCommandReqT req;
uint8_t payload[64];
uint16_t payload_len;
enum ZclStatusCodeT status;
static uint8_t cmd_sequence = 0;

if (zigbee_app_info.last_joined_nwkAddr == 0x0000 ||
zigbee_app_info.last_joined_nwkAddr == 0xffff ||
zigbee_app_info.last_joined_endpoint == 0U) {
APP_DBG("ERROR: Device not joined!");
return;
}

if (dp_data == NULL || dp_len == 0U || dp_len > 56U) {
APP_DBG("ERROR: Invalid DP data (len=%u)", dp_len);
return;
}

// Tuya 鏍囧噯鏍煎紡: [鐘舵€乚[搴忓垪鍙穄[DP ID][DP Type][DP Len High][DP Len Low][DP Data]
payload[0] = 0x00;
payload[1] = cmd_sequence++;
payload[2] = dp_id;
payload[3] = dp_type;
payload[4] = (uint8_t)(dp_len >> 8);
payload[5] = (uint8_t)(dp_len & 0xFF);
memcpy(&payload[6], dp_data, dp_len);
payload_len = (uint16_t)(6U + dp_len);

memset(&req, 0, sizeof(req));
req.dst.mode = ZB_APSDE_ADDRMODE_SHORT;
req.dst.endpoint = zigbee_app_info.last_joined_endpoint;
req.dst.nwkAddr = zigbee_app_info.last_joined_nwkAddr;
req.cmdId = 0x00;
req.noDefaultResp = ZCL_NO_DEFAULT_RESPONSE_FALSE;
req.payload = payload;
req.length = payload_len;

status = ZbZclClusterCommandReq(zigbee_app_info.tuya_client, &req, NULL, NULL);

if (status == ZCL_STATUS_SUCCESS) {
APP_DBG("DP command sent: ID=%u, Data=0x%02x", dp_id, dp_data[0]);
} else {
APP_DBG("DP command failed: 0x%02x", status);
}
}

/**
* @brief 浣跨敤 Tuya DP 鎺у埗鏂矾鍣ㄥ紑鍏?
* @param on: true=寮€闂? false=鍏抽椄
* @note 浣跨敤宸查獙璇佺殑 DP ID 16
* @retval None
*/
static void APP_ZIGBEE_TuyaControlBreaker(bool on)
{
uint8_t dp_data[1];
const uint8_t BREAKER_DP_ID = 16; // 宸查獙璇侊細DP ID 16 鏈夋晥锛?

dp_data[0] = on ? 0x01 : 0x00;

APP_DBG("Control breaker: %s (Target: 0x%04x:EP%u)",
on ? "ON" : "OFF",
zigbee_app_info.last_joined_nwkAddr,
zigbee_app_info.last_joined_endpoint);
APP_ZIGBEE_TuyaSendDpCommand(BREAKER_DP_ID, 0x01, dp_data, sizeof(dp_data));

// 鏇存柊 LED 鍜?LCD 鏄剧ず
APP_ZIGBEE_UpdateBreakerStatus(on);
}

/**
* @brief 鏇存柊鏂矾鍣ㄧ姸鎬佹樉绀猴紙LED 鍜?LCD锛?
* @param on: true=闂悎(ON), false=鏂紑(OFF)
* @retval None
*/
static void APP_ZIGBEE_UpdateBreakerStatus(bool on)
{
// 鏇存柊鐘舵€佸彉閲?
zigbee_app_info.breaker_on = on;

// 鏇存柊 LED 鐘舵€?
if (on) {
// 闂悎鐘舵€侊細绾㈣壊 LED锛堟牴鎹偍鐨勬弿杩帮細绾㈣壊=闂悎锛?
LED_Set_rgb(PWM_LED_GSDATA_47_0, PWM_LED_GSDATA_OFF, PWM_LED_GSDATA_OFF);
} else {
// 鏂紑鐘舵€侊細钃濊壊 LED锛堣摑鑹?鍏抽棴锛?
LED_Set_rgb(PWM_LED_GSDATA_OFF, PWM_LED_GSDATA_OFF, PWM_LED_GSDATA_47_0);
}

// 鏇存柊 LCD 鏄剧ず
char line1[20];
char line2[20];

// 娓呴櫎鏄剧ず
BSP_LCD_Clear(LCD_Inst, SSD1315_COLOR_BLACK);

// 绗竴琛岋細鏄剧ず鏍囬
UTIL_LCD_DisplayStringAt(0, 0, (uint8_t*)"Zigbee Breaker", CENTER_MODE);

// 绗簩琛岋細鏄剧ず鐘舵€?
if (on) {
snprintf(line1, sizeof(line1), "Status: ON");
snprintf(line2, sizeof(line2), "LED: RED");
} else {
snprintf(line1, sizeof(line1), "Status: OFF");
snprintf(line2, sizeof(line2), "LED: BLUE");
}

UTIL_LCD_DisplayStringAt(0, 16, (uint8_t*)line1, CENTER_MODE);
UTIL_LCD_DisplayStringAt(0, 32, (uint8_t*)line2, CENTER_MODE);

// 绗洓琛岋細鏄剧ず鍦板潃
char addr_line[20];
snprintf(addr_line, sizeof(addr_line), "Addr:0x%04X", zigbee_app_info.last_joined_nwkAddr);
UTIL_LCD_DisplayStringAt(0, 48, (uint8_t*)addr_line, CENTER_MODE);

// 鍒锋柊鏄剧ず
BSP_LCD_Refresh(LCD_Inst);
}

/**
* @brief 鏇存柊鐢靛帇銆佺數娴併€佸姛鐜囨樉绀哄埌 LCD
* @param None
* @retval None
*/
static void APP_ZIGBEE_UpdatePowerDisplay(void)
{
char line_voltage[20];
char line_current[20];
char line_power[20];
uint32_t power_x10;

// 娓呴櫎鏄剧ず
BSP_LCD_Clear(LCD_Inst, SSD1315_COLOR_BLACK);

// 绗竴琛岋細鏍囬
UTIL_LCD_DisplayStringAt(0, 0, (uint8_t*)"Power Monitor", CENTER_MODE);

// 绗簩琛岋細鐢靛帇鏄剧ず锛堝崟浣嶏細V锛?
uint16_t voltage_int = zigbee_app_info.tuya_voltage_dv / 10U;
uint16_t voltage_dec = zigbee_app_info.tuya_voltage_dv % 10U;
snprintf(line_voltage, sizeof(line_voltage), "V:%u.%uV", voltage_int, voltage_dec);
UTIL_LCD_DisplayStringAt(0, 16, (uint8_t*)line_voltage, CENTER_MODE);

// 绗笁琛岋細鐢垫祦鏄剧ず锛堝崟浣嶏細A锛?
uint32_t current_int = zigbee_app_info.tuya_current_ma / 1000U;
uint32_t current_dec = (zigbee_app_info.tuya_current_ma % 1000U) / 10U; // 鍙栦袱浣嶅皬鏁?
snprintf(line_current, sizeof(line_current), "I:%lu.%02luA",
         (unsigned long)current_int, (unsigned long)current_dec);
UTIL_LCD_DisplayStringAt(0, 32, (uint8_t*)line_current, CENTER_MODE);

// 绗洓琛岋細鍔熺巼鏄剧ず锛堝崟浣嶏細W锛?
power_x10 = APP_ZIGBEE_ComputePowerX10(zigbee_app_info.tuya_voltage_dv,
                                       zigbee_app_info.tuya_current_ma,
                                       zigbee_app_info.tuya_power_w);
snprintf(line_power, sizeof(line_power), "P:%lu.%luW",
         (unsigned long)(power_x10 / 10U),
         (unsigned long)(power_x10 % 10U));
UTIL_LCD_DisplayStringAt(0, 48, (uint8_t*)line_power, CENTER_MODE);

// 鍒锋柊鏄剧ず
BSP_LCD_Refresh(LCD_Inst);
}

/**
* @brief APS 灞傛姤鏂囨姄鍙栧櫒锛堟姄鍙栨墍鏈夊彂寰€ SNIFFER_ENDPOINT 鐨勬姤鏂囷級
* @param dataInd: APS 鏁版嵁鎸囩ず缁撴瀯浣擄紙鍖呭惈瀹屾暣鐨?ASDU锛?
* @param arg: 鐢ㄦ埛鍙傛暟锛堟湭浣跨敤锛?
* @retval ZB_APS_FILTER_CONTINUE (0)锛氱户缁紶閫掔粰涓婂眰锛沍B_APS_FILTER_DISCARD (1)锛氫涪寮冩姤鏂?
*/
static int APP_ZIGBEE_ApsSniffer(struct ZbApsdeDataIndT *dataInd, void *arg)
{
UNUSED(arg);

#if TUYA_VERBOSE_LOG
APP_DBG("");
APP_DBG("========================================");
APP_DBG("*** APS SNIFFER: Packet Captured ***");
APP_DBG("========================================");
APP_DBG("Source Addr: 0x%04X (EP %u)", dataInd->src.nwkAddr, dataInd->src.endpoint);
APP_DBG("Dest Addr: 0x%04X (EP %u)", dataInd->dst.nwkAddr, dataInd->dst.endpoint);
APP_DBG("Profile ID: 0x%04X", dataInd->profileId);
APP_DBG("Cluster ID: 0x%04X", dataInd->clusterId);
APP_DBG("ASDU Length: %u bytes", dataInd->asduLength);
APP_DBG("========================================");

// 鎵撳嵃瀹屾暣鐨?ASDU锛堝崄鍏繘鍒舵牸寮忥級
if (dataInd->asdu != NULL && dataInd->asduLength > 0) {
APP_DBG(">>> COMPLETE ASDU (HEX):");

