csmdqq-source/pv-iot-project/stm32-firmware/Zigbee_OnOff_Server_Coord/STM32_WPAN/App/app_zigbee.c
// 鍗曡鏍煎紡锛堟柟渚垮鍒讹級
static const char hex[] = "0123456789ABCDEF";
char line[256];
uint16_t pos = 0;
uint16_t display_len = (dataInd->asduLength > 80) ? 80 : dataInd->asduLength;

for (uint16_t i = 0; i < display_len; i++) {
uint8_t b = dataInd->asdu[i];
line[pos++] = hex[b >> 4];
line[pos++] = hex[b & 0x0F];
if (i + 1 < display_len) {
line[pos++] = ' ';
}
}
line[pos] = '\0';
APP_DBG(" %s%s", line, (dataInd->asduLength > 80) ? " ..." : "");

// 澶氳鏍煎紡锛堣缁嗚鍥撅紝姣忚 16 瀛楄妭锛?
APP_DBG(">>> [Multi-line View]:");
for (uint16_t offset = 0; offset < dataInd->asduLength; offset += 16) {
char detail_line[64];
uint16_t chunk = (dataInd->asduLength - offset > 16) ? 16 : (dataInd->asduLength - offset);
uint16_t dpos = 0;

for (uint16_t i = 0; i < chunk; i++) {
uint8_t b = dataInd->asdu[offset + i];
detail_line[dpos++] = hex[b >> 4];
detail_line[dpos++] = hex[b & 0x0F];
if (i + 1 < chunk) {
detail_line[dpos++] = ' ';
}
}
detail_line[dpos] = '\0';
APP_DBG(" [%04u]: %s", offset, detail_line);
}
} else {
APP_DBG(">>> ASDU: <empty>");
}

APP_DBG("========================================");
APP_DBG("");
#endif

// 缁х画浼犻€掔粰涓婂眰 ZCL 澶勭悊锛堜笉闃绘柇姝ｅ父娴佺▼锛?

/* If Tuya EF00 report is sent to SNIFFER_ENDPOINT, parse it here */
if (dataInd->clusterId == TUYA_CLUSTER_ID && dataInd->asdu != NULL && dataInd->asduLength > 0U) {
struct ZbZclHeaderT hdr;
int hdr_len = ZbZclParseHeader(&hdr, dataInd->asdu, dataInd->asduLength);
if (hdr_len >= 0) {
const uint8_t *payload = &dataInd->asdu[hdr_len];
uint16_t payload_len = (uint16_t)(dataInd->asduLength - (uint16_t)hdr_len);
unsigned int dp_count;

TUYA_LOG("APS SNIFFER: Tuya EF00 payload parse");
dp_count = APP_ZIGBEE_TuyaParseDpList(payload, payload_len, 2U);
if (dp_count == 0U) {
dp_count = APP_ZIGBEE_TuyaParseDpList(payload, payload_len, 1U);
}
if (dp_count == 0U) {
(void)APP_ZIGBEE_TuyaParseDpList(payload, payload_len, 0U);
}
} else {
TUYA_LOG("APS SNIFFER: invalid ZCL header (len=%u)", dataInd->asduLength);
}
}

return ZB_APS_FILTER_CONTINUE;
}

/**
* @brief 瀹氭椂鍣ㄥ洖璋冨嚱鏁帮紝瑙﹀彂鍔熺巼鏌ヨ浠诲姟
* @param None
* @retval None
*/
static void APP_ZIGBEE_TuyaQueryTimerCallback(void)
{
  /* 璁剧疆浠诲姟鏍囧織锛岃涓诲惊鐜墽琛屾煡璇?*/
  UTIL_SEQ_SetTask(1U << CFG_TASK_TUYA_QUERY_POWER, CFG_SCH_PRIO_0);
}

static uint32_t APP_ZIGBEE_GetTimestampSeconds(void)
{
  if (g_unix_time_valid) {
    uint32_t delta_ms = HAL_GetTick() - g_unix_time_tick;
    return g_unix_time_base + (delta_ms / 1000U);
  }
  return HAL_GetTick() / 1000U;
}

/**
* @brief  MQTT downlink message callback (remote control)
*         Called when a message arrives on pv/device_001/control
*         Parses {"command":"on"} or {"command":"off"} and controls breaker
*/
static void APP_ZIGBEE_MqttControlCallback(const char *topic, const char *payload, uint16_t len)
{
  APP_DBG("[REMOTE] Received on %s: %.*s", topic, (int)len, payload);

  if (strstr(payload, "\"on\"") != NULL) {
    APP_DBG("[REMOTE] >>> Breaker ON command received");
    if (zigbee_app_info.tuya_bound) {
      APP_ZIGBEE_TuyaControlBreaker(true);
    } else {
      APP_DBG("[REMOTE] WARNING: Tuya not bound, cannot control breaker");
    }
  } else if (strstr(payload, "\"off\"") != NULL) {
    APP_DBG("[REMOTE] >>> Breaker OFF command received");
    if (zigbee_app_info.tuya_bound) {
      APP_ZIGBEE_TuyaControlBreaker(false);
    } else {
      APP_DBG("[REMOTE] WARNING: Tuya not bound, cannot control breaker");
    }
  } else {
    APP_DBG("[REMOTE] Unknown command ignored");
  }
}

/**
* @brief Build JSON payload and publish to cloud via A7670E (MQTT over cellular)
* @param None
* @retval None
*/
static void APP_ZIGBEE_MqttUploadJson(void)
{
  static bool no_data_logged = false;
  static bool link_not_ready_logged = false;
  static bool enqueue_fail_logged = false;
  char json[MQTT_JSON_BUF_SIZE];
  uint16_t voltage_raw = zigbee_app_info.tuya_voltage_dv;
  uint32_t current_ma = zigbee_app_info.tuya_current_ma;
  uint32_t power_w = zigbee_app_info.tuya_power_w;
  uint32_t power_x10 = APP_ZIGBEE_ComputePowerX10(voltage_raw, current_ma, power_w);
  uint16_t voltage_int = voltage_raw / 10U;
  uint16_t voltage_dec = voltage_raw % 10U;
  uint32_t current_int = current_ma / 1000U;
  uint32_t current_dec = (current_ma % 1000U) / 10U; /* two decimals */
  uint32_t power_int = power_x10 / 10U;
  uint32_t power_dec = power_x10 % 10U;
  uint32_t efficiency_int = MQTT_DEFAULT_EFFICIENCY_X10 / 10U;
  uint32_t efficiency_dec = MQTT_DEFAULT_EFFICIENCY_X10 % 10U;
  uint16_t temperature_x10 = zigbee_app_info.tuya_temperature_valid
                             ? zigbee_app_info.tuya_temperature_x10
                             : MQTT_DEFAULT_TEMPERATURE_X10;
  uint32_t temperature_int = temperature_x10 / 10U;
  uint32_t temperature_dec = temperature_x10 % 10U;
  bool status = zigbee_app_info.breaker_on;
  bool data_ready = (voltage_raw != 0U) || (current_ma != 0U) || (power_w != 0U);

  if (!data_ready) {
    if (!no_data_logged) {
      APP_DBG("[MQTT] skip: no power data");
      no_data_logged = true;
    }
    return;
  }
  no_data_logged = false;

  if (!A7670E_IsNetworkReady() || !A7670E_IsMqttConnected()) {
    if (!link_not_ready_logged) {
      APP_DBG("[MQTT] wait: link not ready net=%u mqtt=%u",
              (unsigned int)A7670E_IsNetworkReady(),
              (unsigned int)A7670E_IsMqttConnected());
      link_not_ready_logged = true;
    }
    enqueue_fail_logged = false;
    return;
  }
  link_not_ready_logged = false;

  uint32_t ts = APP_ZIGBEE_GetTimestampSeconds();
  int n = snprintf(json, sizeof(json),
                   "{\"device_id\":\"%s\",\"timestamp\":%lu,"
                   "\"voltage\":%u.%u,\"current\":%lu.%02lu,"
                   "\"power\":%lu.%lu,\"status\":%s,"
                   "\"efficiency\":%lu.%lu,\"temperature\":%lu.%lu}",
                   MQTT_DEVICE_ID, (unsigned long)ts,
                   voltage_int, voltage_dec,
                   (unsigned long)current_int, (unsigned long)current_dec,
                   (unsigned long)power_int, (unsigned long)power_dec,
                   status ? "true" : "false",
                   (unsigned long)efficiency_int, (unsigned long)efficiency_dec,
                   (unsigned long)temperature_int, (unsigned long)temperature_dec);
  if (n <= 0 || n >= (int)sizeof(json)) {
    APP_DBG("MQTT Upload: JSON build failed");
    return;
  }

  bool queued = A7670E_RequestPublish(MQTT_TOPIC, json, (size_t)n, 0U);
  if (queued) {
    enqueue_fail_logged = false;
  } else if (!enqueue_fail_logged) {
    APP_DBG("[MQTT] enqueue fail net=%u mqtt=%u",
            (unsigned int)A7670E_IsNetworkReady(),
            (unsigned int)A7670E_IsMqttConnected());
    enqueue_fail_logged = true;
  }
}

/**
* @brief 鍛ㄦ湡鎬ф煡璇uya鍔熺巼鏁版嵁浠诲姟
* @param None
* @retval None
*/
static void APP_ZIGBEE_TuyaQueryPowerTask(void)
{
  /* 浠呭湪缁戝畾鎴愬姛鍚庢墠鏌ヨ */
  if (zigbee_app_info.tuya_bound) {
    APP_ZIGBEE_TuyaQueryPowerData();
  }
  APP_ZIGBEE_MqttUploadJson();
}

/* USER CODE END FD_LOCAL_FUNCTIONS */
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
